src/main/java/ok/dht/test/slastin/wrk2/data/get-100.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 2.176ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.47ms  767.51us  11.65ms   67.53%
    Req/Sec   104.84     27.11   222.00     93.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.43ms
 75.000%    3.00ms
 90.000%    3.40ms
 99.000%    4.18ms
 99.900%    7.72ms
 99.990%   11.65ms
 99.999%   11.65ms
100.000%   11.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.954     0.000000            1         1.00
       1.537     0.100000          500         1.11
       1.774     0.200000         1000         1.25
       1.976     0.300000         1502         1.43
       2.179     0.400000         2000         1.67
       2.435     0.500000         2504         2.00
       2.565     0.550000         2754         2.22
       2.675     0.600000         3006         2.50
       2.787     0.650000         3252         2.86
       2.901     0.700000         3504         3.33
       3.003     0.750000         3750         4.00
       3.053     0.775000         3877         4.44
       3.111     0.800000         4000         5.00
       3.185     0.825000         4127         5.71
       3.259     0.850000         4256         6.67
       3.329     0.875000         4378         8.00
       3.367     0.887500         4437         8.89
       3.401     0.900000         4500        10.00
       3.437     0.912500         4562        11.43
       3.483     0.925000         4627        13.33
       3.541     0.937500         4687        16.00
       3.575     0.943750         4720        17.78
       3.611     0.950000         4750        20.00
       3.659     0.956250         4784        22.86
       3.697     0.962500         4813        26.67
       3.741     0.968750         4844        32.00
       3.799     0.971875         4859        35.56
       3.837     0.975000         4875        40.00
       3.891     0.978125         4890        45.71
       3.951     0.981250         4906        53.33
       4.017     0.984375         4923        64.00
       4.047     0.985938         4930        71.11
       4.091     0.987500         4937        80.00
       4.139     0.989062         4945        91.43
       4.211     0.990625         4953       106.67
       4.279     0.992188         4960       128.00
       4.315     0.992969         4964       142.22
       4.355     0.993750         4968       160.00
       4.535     0.994531         4972       182.86
       4.667     0.995313         4976       213.33
       4.907     0.996094         4980       256.00
       4.971     0.996484         4982       284.44
       5.307     0.996875         4984       320.00
       5.399     0.997266         4986       365.71
       5.587     0.997656         4988       426.67
       6.051     0.998047         4990       512.00
       6.231     0.998242         4991       568.89
       6.967     0.998437         4992       640.00
       7.523     0.998633         4993       731.43
       7.723     0.998828         4994       853.33
       8.055     0.999023         4995      1024.00
       8.055     0.999121         4995      1137.78
       8.623     0.999219         4996      1280.00
       8.623     0.999316         4996      1462.86
       9.495     0.999414         4997      1706.67
       9.495     0.999512         4997      2048.00
       9.495     0.999561         4997      2275.56
      11.271     0.999609         4998      2560.00
      11.271     0.999658         4998      2925.71
      11.271     0.999707         4998      3413.33
      11.271     0.999756         4998      4096.00
      11.271     0.999780         4998      4551.11
      11.655     0.999805         4999      5120.00
      11.655     1.000000         4999          inf
#[Mean    =        2.468, StdDeviation   =        0.768]
#[Max     =       11.648, Total count    =         4999]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6001 requests in 1.00m, 1.22MB read
Requests/sec:    100.01
Transfer/sec:     20.86KB