src/main/java/ok/dht/test/slastin/wrk2/data/get-1000.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 14.023ms, rate sampling interval: 97ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     8.84ms   19.58ms 140.29ms   92.46%
    Req/Sec     1.00k   137.85     1.85k    82.72%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.82ms
 75.000%    6.14ms
 90.000%   20.29ms
 99.000%  110.97ms
 99.900%  136.83ms
 99.990%  140.29ms
 99.999%  140.41ms
100.000%  140.41ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.310     0.000000            1         1.00
       0.854     0.100000         5001         1.11
       1.114     0.200000        10001         1.25
       1.331     0.300000        15007         1.43
       1.542     0.400000        20018         1.67
       1.817     0.500000        25000         2.00
       2.014     0.550000        27501         2.22
       2.301     0.600000        30008         2.50
       2.883     0.650000        32505         2.86
       4.049     0.700000        34996         3.33
       6.143     0.750000        37496         4.00
       7.563     0.775000        38748         4.44
       9.223     0.800000        39996         5.00
      11.151     0.825000        41246         5.71
      13.519     0.850000        42497         6.67
      16.215     0.875000        43746         8.00
      18.287     0.887500        44370         8.89
      20.287     0.900000        44996        10.00
      23.247     0.912500        45623        11.43
      28.671     0.925000        46246        13.33
      37.023     0.937500        46871        16.00
      42.655     0.943750        47182        17.78
      48.319     0.950000        47495        20.00
      53.951     0.956250        47808        22.86
      60.959     0.962500        48120        26.67
      69.311     0.968750        48432        32.00
      72.767     0.971875        48588        35.56
      77.951     0.975000        48745        40.00
      85.311     0.978125        48901        45.71
      93.247     0.981250        49057        53.33
      98.815     0.984375        49213        64.00
     100.991     0.985938        49291        71.11
     105.471     0.987500        49370        80.00
     109.695     0.989062        49451        91.43
     111.487     0.990625        49526       106.67
     114.111     0.992188        49604       128.00
     115.583     0.992969        49643       142.22
     117.631     0.993750        49682       160.00
     119.871     0.994531        49721       182.86
     121.983     0.995313        49760       213.33
     124.991     0.996094        49799       256.00
     126.591     0.996484        49819       284.44
     128.575     0.996875        49841       320.00
     129.215     0.997266        49859       365.71
     131.071     0.997656        49878       426.67
     132.991     0.998047        49897       512.00
     133.759     0.998242        49909       568.89
     134.271     0.998437        49917       640.00
     135.423     0.998633        49926       731.43
     136.319     0.998828        49936       853.33
     136.831     0.999023        49949      1024.00
     136.959     0.999121        49953      1137.78
     137.087     0.999219        49957      1280.00
     137.215     0.999316        49966      1462.86
     137.215     0.999414        49966      1706.67
     137.471     0.999512        49971      2048.00
     137.599     0.999561        49974      2275.56
     137.727     0.999609        49975      2560.00
     138.623     0.999658        49977      2925.71
     139.263     0.999707        49981      3413.33
     139.519     0.999756        49982      4096.00
     139.903     0.999780        49984      4551.11
     140.159     0.999805        49988      5120.00
     140.159     0.999829        49988      5851.43
     140.159     0.999854        49988      6826.67
     140.159     0.999878        49988      8192.00
     140.287     0.999890        49993      9102.22
     140.287     0.999902        49993     10240.00
     140.287     0.999915        49993     11702.86
     140.287     0.999927        49993     13653.33
     140.287     0.999939        49993     16384.00
     140.287     0.999945        49993     18204.44
     140.287     0.999951        49993     20480.00
     140.287     0.999957        49993     23405.71
     140.287     0.999963        49993     27306.67
     140.287     0.999969        49993     32768.00
     140.287     0.999973        49993     36408.89
     140.287     0.999976        49993     40960.00
     140.287     0.999979        49993     46811.43
     140.415     0.999982        49994     54613.33
     140.415     1.000000        49994          inf
#[Mean    =        8.844, StdDeviation   =       19.583]
#[Max     =      140.288, Total count    =        49994]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59999 requests in 1.00m, 12.23MB read
Requests/sec:    999.99
Transfer/sec:    208.69KB