src/main/java/ok/dht/test/slastin/wrk2/data/get-2000.txt
Running 1m test @ http://localhost:2022
  1 threads and 1 connections
  Thread calibration: mean lat.: 99.550ms, rate sampling interval: 845ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   134.26ms  241.81ms   1.05s    83.53%
    Req/Sec     2.01k   349.15     3.05k    77.97%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.07ms
 75.000%  102.53ms
 90.000%  565.76ms
 99.000%  958.97ms
 99.900%    1.04s 
 99.990%    1.05s 
 99.999%    1.05s 
100.000%    1.05s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.252     0.000000            1         1.00
       0.769     0.100000        10034         1.11
       1.179     0.200000        20073         1.25
       2.057     0.300000        30092         1.43
       5.479     0.400000        40122         1.67
      11.071     0.500000        50162         2.00
      15.031     0.550000        55168         2.22
      20.079     0.600000        60191         2.50
      26.143     0.650000        65200         2.86
      36.543     0.700000        70218         3.33
     102.527     0.750000        75225         4.00
     195.583     0.775000        77733         4.44
     304.127     0.800000        80244         5.00
     355.583     0.825000        82754         5.71
     407.295     0.850000        85260         6.67
     485.631     0.875000        87769         8.00
     532.991     0.887500        89033         8.89
     565.759     0.900000        90271        10.00
     598.527     0.912500        91541        11.43
     646.143     0.925000        92801        13.33
     681.983     0.937500        94049        16.00
     694.783     0.943750        94669        17.78
     705.023     0.950000        95304        20.00
     713.727     0.956250        95927        22.86
     729.087     0.962500        96545        26.67
     765.439     0.968750        97180        32.00
     769.535     0.971875        97483        35.56
     802.815     0.975000        97794        40.00
     826.879     0.978125        98112        45.71
     837.631     0.981250        98421        53.33
     872.447     0.984375        98733        64.00
     895.999     0.985938        98889        71.11
     920.063     0.987500        99046        80.00
     945.151     0.989062        99206        91.43
     965.631     0.990625        99361       106.67
     985.599     0.992188        99523       128.00
     993.791     0.992969        99599       142.22
     999.423     0.993750        99674       160.00
    1005.055     0.994531        99754       182.86
    1010.175     0.995313        99829       213.33
    1018.879     0.996094        99908       256.00
    1022.463     0.996484        99948       284.44
    1025.535     0.996875        99987       320.00
    1029.119     0.997266       100025       365.71
    1032.703     0.997656       100065       426.67
    1037.823     0.998047       100105       512.00
    1039.871     0.998242       100125       568.89
    1041.407     0.998437       100143       640.00
    1042.431     0.998633       100162       731.43
    1044.479     0.998828       100187       853.33
    1044.991     0.999023       100216      1024.00
    1044.991     0.999121       100216      1137.78
    1045.503     0.999219       100227      1280.00
    1046.015     0.999316       100244      1462.86
    1046.015     0.999414       100244      1706.67
    1047.039     0.999512       100255      2048.00
    1047.039     0.999561       100255      2275.56
    1047.551     0.999609       100269      2560.00
    1047.551     0.999658       100269      2925.71
    1048.063     0.999707       100280      3413.33
    1048.063     0.999756       100280      4096.00
    1048.063     0.999780       100280      4551.11
    1048.063     0.999805       100280      5120.00
    1048.575     0.999829       100297      5851.43
    1048.575     0.999854       100297      6826.67
    1048.575     0.999878       100297      8192.00
    1048.575     0.999890       100297      9102.22
    1048.575     0.999902       100297     10240.00
    1048.575     0.999915       100297     11702.86
    1048.575     0.999927       100297     13653.33
    1048.575     0.999939       100297     16384.00
    1048.575     0.999945       100297     18204.44
    1048.575     0.999951       100297     20480.00
    1048.575     0.999957       100297     23405.71
    1048.575     0.999963       100297     27306.67
    1048.575     0.999969       100297     32768.00
    1048.575     0.999973       100297     36408.89
    1048.575     0.999976       100297     40960.00
    1048.575     0.999979       100297     46811.43
    1049.599     0.999982       100299     54613.33
    1049.599     1.000000       100299          inf
#[Mean    =      134.261, StdDeviation   =      241.814]
#[Max     =     1048.576, Total count    =       100299]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119999 requests in 1.00m, 24.45MB read
Requests/sec:   1999.95
Transfer/sec:    417.34KB